# vstEnableMode

## Description
```pascal
PROCEDURE vstEnableMode(
				inModeNumber : INTEGER;
				inEnable     : BOOLEAN);
```

```python

def vs.vstEnableMode(inModeNumber, inEnable):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inModeNumber|INTEGER||
|inEnable|BOOLEAN||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events